app/controllers/boards_controller.rb

SELECT COUNT(*) FROM "boards" WHERE "boards"."user_id" = $1 AND "boards"."webtoon_id" = $2  [["user_id", 1], ["webtoon_id", 1]]
INSERT INTO "boards" ("user_id", "webtoon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["webtoon_id", 3], ["created_at", "2020-11-27 02:15:36.576915"], ["updated_at", "2020-11-27 02:15:36.576915"]]
---
  def create
    @board = Board.new(board_params)
	user_id = @board.user_id
	webtoon_id = @board.webtoon_id
	@webtoon_overlap = Board.where(user_id: user_id, webtoon_id: webtoon_id).size
    respond_to do |format|
      if @webtoon_overlap > 0
		  format.html{redirect_to webtoons_path, notice: '이미 구독한 작품입니다.'}
	  elsif @board.save

DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 38]]
---
  def destroy
    @board.destroy