app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("event_name", "structure", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_name", "개그장르 할인 쿠폰"], ["structure", "개그장르 웹툰 구독 5개 이상 및 전체구독 10개 이상인 유저"], ["created_at", "2020-11-26 11:23:24.167894"], ["updated_at", "2020-11-26 11:23:24.167894"]]