app/controllers/platforms_controller.rb

  def index
    @platforms = Platform.all
---
SELECT "platforms".* FROM "platforms"

  def create
    @platform = Platform.new(platform_params)
	user_id = @platform.user_id
	event_id = @platform.event_id
	@event_overlap = Platform.where(user_id: user_id, event_id: event_id).size
    respond_to do |format|

	  if @event_overlap > 0
		  format.html{redirect_to events_path, notice: '이 이벤트는 이미 신청하였습니다.'}
	  elsif @platform.save
---
SELECT COUNT(*) FROM "platforms" WHERE "platforms"."user_id" = $1 AND "platforms"."event_id" = $2  [["user_id", 1], ["event_id", 1]]
INSERT INTO "platforms" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2020-11-26 11:49:08.563970"], ["updated_at", "2020-11-26 11:49:08.563970"]]

  def destroy
    @platform.destroy
---
DELETE FROM "platforms" WHERE "platforms"."id" = $1  [["id", 13]]

    def set_platform
      @platform = Platform.find(params[:id])
---
SELECT  "platforms".* FROM "platforms" WHERE "platforms"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]