app/controllers/webtoons_controller.rb

  def index
    @webtoons = Webtoon.all
---
SELECT "webtoons".* FROM "webtoons"

  def create
    @webtoon = Webtoon.new(webtoon_params)

    respond_to do |format|
      if @webtoon.save
---
INSERT INTO "webtoons" ("writer", "webtoon_name", "gerne", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["writer", "조석"], ["webtoon_name", ""], ["gerne", ""], ["created_at", "2020-11-26 10:17:54.207971"], ["updated_at", "2020-11-26 10:17:54.207971"]]

  def update
    respond_to do |format|
      if @webtoon.update(webtoon_params)
---
UPDATE "webtoons" SET "webtoon_name" = $1, "gerne" = $2, "updated_at" = $3 WHERE "webtoons"."id" = $4  [["webtoon_name", "마음의 소리"], ["gerne", "개그, 일상"], ["updated_at", "2020-11-26 10:18:06.645275"], ["id", 1]]

    def set_webtoon
      @webtoon = Webtoon.find(params[:id])
---
SELECT  "webtoons".* FROM "webtoons" WHERE "webtoons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]